; domain
(define (domain NUT-ASSEMBLY)
  (:requirements :strips :typing)

  ;; Types
  (:types nut peg robot)

  ;; Predicates
  (:predicates
    
    (free ?p - peg)                          
    (handempty ?r - robot)                               
    (grasped ?r - robot ?n - nut)            
    (on_peg ?n - nut ?p - peg)               
    (assembled ?n - nut)                     

    
    (is_hex ?n - nut)                        
    (is_square ?n - nut)                     
    (is_circular ?p - peg)                  
    (is_square_peg ?p - peg)                  
  )

  ;; Pick action
  (:action pick
    :parameters (?r - robot ?n - nut)
    :precondition (and (handempty ?r))
    :effect (and 
      (grasped ?r ?n)
      (not (handempty ?r))
    )
  )

  ;; Place the hex nut onto a circular peg
  (:action place_on_peg_hex
    :parameters (?r - robot ?n - nut ?p - peg)
    :precondition (and 
        (grasped ?r ?n)
        (free ?p)
        (is_hex ?n)
        (is_circular ?p)
    )
    :effect (and
        (on_peg ?n ?p)
        (assembled ?n)
        (not (grasped ?r ?n))
        (handempty ?r)
        (not (free ?p))
    )
  )

  ;;place the squared nut onto a square peg
  (:action place_on_peg_square
    :parameters (?r - robot ?n - nut ?p - peg)
    :precondition (and 
        (grasped ?r ?n)
        (free ?p)
        (is_square ?n)
        (is_square_peg ?p)
    )
    :effect (and
        (on_peg ?n ?p)
        (assembled ?n)
        (not (grasped ?r ?n))
        (handempty ?r)
        (not (free ?p))
    )
  )

)

; problem
(define (problem nut-assembly)
  (:domain NUT-ASSEMBLY)

  (:objects
    robot1 - robot
    hexnut squarenut - nut
    peg1 peg2 - peg
  )

  (:init

    ;; Pegs are free
    (free peg1)
    (free peg2)

    ;; Robot is not holding anything
    (handempty robot1)

    ;; Nut types
    (is_hex hexnut)
    (is_square squarenut)

    ;; Peg types
    (is_square_peg peg1)
    (is_circular peg2)
  )

  (:goal
    (and
      (assembled hexnut)
      (assembled squarenut)
    )
  )
)

; plan
1. (pick robot1 squarenut)
   deleted: (handempty robot1)
   added: (grasped robot1 squarenut)
   goals met: 0 of 2
2. (place_on_peg_square robot1 squarenut peg1)
   deleted: (grasped robot1 squarenut) (free peg1)
   added: (on_peg squarenut peg1) (assembled squarenut) (handempty robot1)
   goals met: 1 of 2
3. (pick robot1 hexnut)
   deleted: (handempty robot1)
   added: (grasped robot1 hexnut)
   goals met: 1 of 2
4. (place_on_peg_hex robot1 hexnut peg2)
   deleted: (grasped robot1 hexnut) (free peg2)
   added: (on_peg hexnut peg2) (assembled hexnut) (handempty robot1)
   goals met: 2 of 2
